import * as Mock from "mockjs";

export const data = Mock.mock({
    "list|20-40": [{
        id: "@increment",
        title: "@cword(10,20)",
        date: "@date(yyyy-mm-dd)"
    }]
})


//
// const a =[{
//     title: "第八期立项师生匹配阶段面向导师的通知",
//     date: "2020-04-01"
// },
//     {
//         title: "第八期立项师生匹配阶段面向学生的通知",
//         date: "2020-04-01"
//     },
//     {
//         title: "上海交通大学䇹政项目第七期立项通讯评议结果公示",
//         date: "2019-05-08"
//     },
//     {
//         title: "第七期䇹政项目管理系统“学生报名阶段”操作指南",
//         date: "2019-03-04"
//     },
//     {
//         title: "䇹政项目第六期拟成功立项名单公示",
//         date: "2018-05-21"
//     },
//     {
//         title: "上海交通大学䇹政项目第六期立项通讯评议结果公示",
//         date: "2018-05-09"
//     },
//     {
//         title: "关于第六期立项材料模板的通知",
//         date: "2018-04-08"
//     },
//     {
//         title: "关于第六期立项宣讲会的通知",
//         date: "2018-04-05"
//     },
//     {
//         title: "第六期立项师生匹配阶段面向学生的通知",
//         date: "2018-03-26"
//     },
//     {
//         title: "第六期立项师生匹配阶段面向导师的通知",
//         date: "2018-03-26"
//     }
// ]